Revit 2017 API
ShapeImporter Class
 An utility class that supports conversion of geometry stored in an external format into a Revit geometry objects.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2017
Syntax
C#
public class ShapeImporter : IDisposable
Visual Basic
Public Class ShapeImporter _
	Implements IDisposable
Visual C++
public ref class ShapeImporter : IDisposable
Remarks
 See ShapeImporterSourceFormat for the list of supported formats.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ShapeImporter
See Also
ShapeImporter Members
Autodesk.Revit.DB Namespace